templates/NotaFiscal.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:e="http://www.e-governeapps2.com.br/" xmlns:xd="http://www.w3.org/2000/09/xmldsig#">
   <soap:Header/>
   <soap:Body>
      <e:RecepcionarLoteRps>
         <e:EnviarLoteRpsEnvio>
            <e:LoteRps>
               <e:NumeroLote>1028</e:NumeroLote>
               <e:Cnpj>12345678000100</e:Cnpj>
               <e:InscricaoMunicipal>1234567</e:InscricaoMunicipal>
               <e:QuantidadeRps>1</e:QuantidadeRps>
               <e:ListaRps>
                  <e:Rps>
                     <e:InfRps>
                        <e:IdentificacaoRps>
                           <e:Numero>3</e:Numero>
                           <e:Serie>f</e:Serie>
                           <e:Tipo>1</e:Tipo>
                        </e:IdentificacaoRps>
                        <e:DataEmissao>2018-12-04T11:01:53-03:00</e:DataEmissao>
                        <e:NaturezaOperacao>1</e:NaturezaOperacao>
                        <e:RegimeEspecialTributacao>1</e:RegimeEspecialTributacao>
                        <e:OptanteSimplesNacional>1</e:OptanteSimplesNacional>
                        <e:IncentivadorCultural>2</e:IncentivadorCultural>
                        <e:Status>1</e:Status>
                        <e:Servico>
                           <e:Valores>
                              <e:ValorServicos>1.00</e:ValorServicos>
                              <e:ValorDeducoes>0.00</e:ValorDeducoes>
                              <e:ValorPis>0.00</e:ValorPis>
                              <e:ValorCofins>0.00</e:ValorCofins>
                              <e:ValorInss>0.00</e:ValorInss>
                              <e:ValorIr>0.00</e:ValorIr>
                              <e:ValorCsll>0.00</e:ValorCsll>
                              <e:IssRetido>2</e:IssRetido>
                              <e:ValorIss>0.00</e:ValorIss>
                              <e:ValorIssRetido>0.00</e:ValorIssRetido>
                              <e:OutrasRetencoes>0.00</e:OutrasRetencoes>
                              <e:BaseCalculo>0.00</e:BaseCalculo>
                              <e:Aliquota>0.05</e:Aliquota>
                              <e:ValorLiquidoNfse>1.00</e:ValorLiquidoNfse>
                              <e:DescontoIncondicionado>0.00</e:DescontoIncondicionado>
                              <e:DescontoCondicionado>0.00</e:DescontoCondicionado>
                           </e:Valores>
                           <e:ItemListaServico>1505</e:ItemListaServico>
                           <e:Discriminacao>TESTE DE EMISSAO Valor Aproximado</e:Discriminacao>
                           <e:CodigoMunicipio>4106902</e:CodigoMunicipio>
                        </e:Servico>
                        <e:Prestador>
                           <e:Cnpj>12345678000100</e:Cnpj>
                           <e:InscricaoMunicipal>1234567</e:InscricaoMunicipal>
                        </e:Prestador>
                        <e:Tomador>
                           <e:IdentificacaoTomador>
                              <e:CpfCnpj>
                                 <e:Cnpj>98765432000100</e:Cnpj>
                              </e:CpfCnpj>
                           </e:IdentificacaoTomador>
                           <e:RazaoSocial>TESTE INFORMACOES E TECNOLOGIA LTDA</e:RazaoSocial>
                           <e:Endereco>
                              <e:Endereco>R DUTRA</e:Endereco>
                              <e:Numero>5</e:Numero>
                              <e:Complemento>ANDAR15</e:Complemento>
                              <e:Bairro>CENTRO</e:Bairro>
                              <e:CodigoMunicipio>4125506</e:CodigoMunicipio>
                              <e:Uf>PR</e:Uf>
                              <e:Cep>80000000</e:Cep>
                           </e:Endereco>
                           <e:Contato>
                              <e:Email>contato@teste.com.br</e:Email>
                           </e:Contato>
                        </e:Tomador>
                     </e:InfRps>
                  </e:Rps>
               </e:ListaRps>
            </e:LoteRps>
         </e:EnviarLoteRpsEnvio>
      </e:RecepcionarLoteRps>
   </soap:Body>
</soap:Envelope>